app/Controllers/Admin/CourseController.php

    public function index()
    {
        $courses = $this->courseModel->select('courses.*, users.name as instructor_name')
                                    ->join('users', 'users.id = courses.instructor_id', 'left')
                                    ->findAll();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`