app/Controllers/Admin/MoodleManagerController.php

    protected function getIntegrationStats()
    {
        $stats = [
            'total_cite_courses' => 0,
            'total_moodle_courses' => 0,
            'synced_courses' => 0,
            'cite_users' => 0,
            'users_with_moodle_id' => 0,
            'last_sync' => null
        ];

        try {
            // CITE statistics
            $stats['total_cite_courses'] = $this->courseModel->countAllResults();
            $stats['synced_courses'] = $this->courseModel->where('moodle_id IS NOT NULL')->countAllResults();
            $stats['cite_users'] = $this->userModel->countAllResults();
            $stats['users_with_moodle_id'] = $this->userModel->where('moodle_id IS NOT NULL')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `courses`
SELECT COUNT(*) AS `numrows`
FROM `courses`
WHERE `moodle_id` IS NOT NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `moodle_id` IS NOT NULL