app/Controllers/Admin/UserController.php

    public function index()
    {
        $data = [
            'users' => $this->userModel->findAll(),
            'title' => 'Manage Users'
        ];
---
SELECT *
FROM `users`

    public function show($id = null)
    {
        $user = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'