app/Controllers/BaseController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.
        $this->session = service('session');
        $this->validation = service('validation');

        // Load current user if authenticated
        if ($this->session->has('user_id')) {
            $userModel = new \App\Models\UserModel();
            $this->currentUser = $userModel->find($this->session->get('user_id'));