app/Controllers/DashboardController.php

    protected function adminDashboard()
    {
        $data = [
            'totalUsers' => $this->userModel->countAll(),
            'totalCourses' => $this->courseModel->countAll(),
            'totalEnrollments' => $this->enrollmentModel->where('status', 'active')->countAllResults(),
            'totalInstructors' => $this->userModel->where('role', 'instructor')->countAllResults()
---
SELECT COUNT(*) AS `numrows` FROM `courses`
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'instructor'