app/Models/CourseModel.php

    public function getWithInstructor($courseId)
    {
        return $this->select('courses.*, users.name as instructor_name, users.email as instructor_email')
                    ->join('users', 'users.id = courses.instructor_id')
                    ->find($courseId);
---
SELECT `courses`.*, `users`.`name` as `instructor_name`, `users`.`email` as `instructor_email`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
WHERE `courses`.`id` = '7'

    public function getActiveCourses()
    {
        return $this->where('status', 'active')->findAll();
---
SELECT *
FROM `courses`
WHERE `status` = 'active'

    public function getCoursesByInstructor($instructorId)
    {
        return $this->where('instructor_id', $instructorId)->findAll();
---
SELECT *
FROM `courses`
WHERE `instructor_id` = '2'

    public function getEnrolledStudents($courseId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('enrollments');

        return $builder->select('users.*, enrollments.enrollment_date, enrollments.status as enrollment_status')
                       ->join('users', 'users.id = enrollments.user_id')
                       ->where('enrollments.course_id', $courseId)
                       ->where('enrollments.status', 'active')
                       ->get()
                       ->getResultArray();
---
SELECT `users`.*, `enrollments`.`enrollment_date`, `enrollments`.`status` as `enrollment_status`
FROM `enrollments`
JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `enrollments`.`course_id` = '7'
AND `enrollments`.`status` = 'active'

    public function getEnrollmentCount($courseId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('enrollments');

        return $builder->where([
            'course_id' => $courseId,
            'status' => 'active'
        ])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `course_id` = '7'
AND `status` = 'active'