app/Models/EnrollmentModel.php

    public function getStudentEnrollments($userId)
    {
        return $this->select('enrollments.*, courses.title, courses.description, courses.instructor_id')
                    ->join('courses', 'courses.id = enrollments.course_id')
                    ->where('enrollments.user_id', $userId)
                    ->findAll();
---
SELECT `enrollments`.*, `courses`.`title`, `courses`.`description`, `courses`.`instructor_id`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '3'

    public function getActiveEnrollments($userId)
    {
        return $this->select('enrollments.*, courses.title, courses.description')
                    ->join('courses', 'courses.id = enrollments.course_id')
                    ->where('enrollments.user_id', $userId)
                    ->where('enrollments.status', 'active')
                    ->findAll();
---
SELECT `enrollments`.*, `courses`.`title`, `courses`.`description`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '3'
AND `enrollments`.`status` = 'active'