app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'admin@cite.local'
 LIMIT 1
---
    public function findByEmail($email)
    {
        return $this->where('email', $email)->first();

UPDATE `users` SET `remember_token` = NULL, `updated_at` = '2025-09-05 07:27:24'
WHERE `users`.`id` IN ('2')
---
    public function updateRememberToken($userId, $token = null)
    {
        return $this->update($userId, ['remember_token' => $token]);